app/controllers/books_controller.rb

  def editall
    @book = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("content", "created_at", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "dfsdfasfsa"], ["created_at", Fri, 18 Jan 2013 23:13:06 UTC +00:00], ["price", 4], ["title", "title"], ["updated_at", Fri, 18 Jan 2013 23:13:06 UTC +00:00]]

  def updates
    @book = Book.update(params[:book].keys,params[:book].values)
---
UPDATE "books" SET "title" = 'fdfd', "updated_at" = '2013-01-20 12:00:00.786894' WHERE "books"."id" = 2